#include <iostream>
using namespace std;
void yard4(int yrd4, int yr4);
void enter1(int ent1, int con1);
void floor3(int fl3, int fr3);
void cyep1(int cy1);
void cyep2(int cy2);
void cyep3(int cy3);
void cyep4(int cy4);
void cyep5(int cy5);
int main();
void attic1(int att1) {
	int x, y;
	cout << "___________________________________________\nÂû àêêóðàòíî çàãëÿíóëè íà ÷åðäàê...òàì ïîëíî ëåòó÷èõ ìûøåé...\nÇàëåçòü 1; Óéòè 2" << endl;
	cin >> y;
	if (y == 1) {
		cout << "___________________________________________\nÂû çàëåçëè íà ÷åðäàê è çàêðûëè çà ñîáîé ëþê...íà âàñ òîò÷àñ íàïàëè ëåòó÷èå ìûøè...\nÎíè íàíîñèëè âàì òÿæ¸ëûå óâå÷üÿ ñ êàæäîé àòàêîé...\nÂÛ ÏÎÃÈÁËÈ" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0)
			main();
	}
	if (y == 2)
		cyep1(1);
}
void attic2(int att2) {
	int x, y;
	cout << "___________________________________________\nÂû àêêóðàòíî çàãëÿíóëè íà ÷åðäàê...òàì ïîëíî ëåòó÷èõ ìûøåé...\nÇàëåçòü 1; Óéòè 2" << endl;
	cin >> y;
	if (y == 1) {
		cout << "___________________________________________\nÂû çàëåçëè íà ÷åðäàê è çàêðûëè çà ñîáîé ëþê...íà âàñ òîò÷àñ íàïàëè ëåòó÷èå ìûøè...\nÎíè íàíîñèëè âàì òÿæ¸ëûå óâå÷üÿ ñ êàæäîé àòàêîé...\nÂÛ ÏÎÃÈÁËÈ" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0)
			main();
	}
	if (y == 2)
		cyep2(1);
}
void attic3(int att3) {
	int x, y;
	cout << "___________________________________________\nÂû àêêóðàòíî çàãëÿíóëè íà ÷åðäàê...òàì ïîëíî ëåòó÷èõ ìûøåé...\nÇàëåçòü 1; Óéòè 2" << endl;
	cin >> y;
	if (y == 1) {
		cout << "___________________________________________\nÂû çàëåçëè íà ÷åðäàê è çàêðûëè çà ñîáîé ëþê...íà âàñ òîò÷àñ íàïàëè ëåòó÷èå ìûøè...\nÎíè íàíîñèëè âàì òÿæ¸ëûå óâå÷üÿ ñ êàæäîé àòàêîé...\nÂÛ ÏÎÃÈÁËÈ" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0)
			main();
	}
	if (y == 2)
		cyep3(1);
}
void attic4(int att4) {
	int x, y;
	cout << "___________________________________________\nÂû àêêóðàòíî çàãëÿíóëè íà ÷åðäàê...òàì ïîëíî ëåòó÷èõ ìûøåé...\nÇàëåçòü 1; Óéòè 2" << endl;
	cin >> y;
	if (y == 1) {
		cout << "___________________________________________\nÂû çàëåçëè íà ÷åðäàê è çàêðûëè çà ñîáîé ëþê...íà âàñ òîò÷àñ íàïàëè ëåòó÷èå ìûøè...\nÎíè íàíîñèëè âàì òÿæ¸ëûå óâå÷üÿ ñ êàæäîé àòàêîé...\nÂÛ ÏÎÃÈÁËÈ" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0)
			main();
	}
	if (y == 2)
		cyep4(1);
}
void attic5(int att5) {
	int x, y;
	cout << "___________________________________________\nÂû àêêóðàòíî ïðèîòêðûëè ëþê...\nÊèíóòü ïåòàðäó 1; Óéòè 2" << endl;
	cin >> x;
	if (x == 1) {
		cout << "___________________________________________\nÂû ïîäîæãëè è çàêèíóâ ïåòàðäó íà ÷åðäàê, çàêðûëè ëþê...\nÏðîãðåìåë âçðûâ, à ïîñëå àäñêîå îòðîäüå ðàçðàçèëîñü êðèêàìè...êîãäà âñ¸ ñòèõëî âû çàëåçëè íà ÷åðäàê\nÂ öåíòðå ÷åðäàêà ëåæàë áîëüøîé ÿùèê...âíóòðè íåãî áûëî íåìíîãî âçðûâ÷àòêè\nÂåðíóòüñÿ âî äâîð 1" << endl;
		cin >> y;
		if (y == 1) {
			cout << "___________________________________________\nÂû áûñòðûì áåãîì ñïóñòèëèñü íà ïåðâûé ýòàæ è âûøëè íà óëèöó..." << endl;
			yard4(1, 0);
		}
	}	
	if(x==2)
	cyep5(1);
}