#include <iostream>
using namespace std;
void floor3(int fl3, int fr3);
void enter1(int ent1, int con1);
int main();
void kitchen1(int kit1) {
	int x;
	cout << "___________________________________________\nЗайдя на кухню вы увидели...кухню УДИВИТЕЛЬНО...\nНа столе стоит много еды...в воздухе ведает запах свежеприготовленной еды...\nВам очень захотелось поесть\nПодойдя к столу вы не в силах были остановиться\nСев за стол и начав есть вы сразу почувствовали насколько вкусна эта еда" << endl;
	cout << "___________________________________________\nВы сидели и ели уже около 10 минут, как вздруг вы почувствовали удар по спине, а после и невыносимую боль...\nПосле чего вас кто-то схватил и скинул на пол...\nПеред смертью вы успели увидеть только летящий в вас топор\nВЫ ПОГИБЛИ" << endl;
	cout << "___________________________________________\nНАЧАТЬ ЗАНОВО: ";
	cin >> x;
	if (x == 3509) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		enter1(1, 0);
	}
	if (x == 5296) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		floor3(1, 0);
	}
	if (x > 0) {
		cout << endl << endl << endl;
		main();
	}
}
void kitchen2(int kit1) {
	int x;
	cout << "___________________________________________\nЗайдя на кухню вы увидели...кухню УДИВИТЕЛЬНО...\nНа столе стоит много еды...в воздухе ведает запах свежеприготовленной еды...\nВам очень захотелось поесть\nПодойдя к столу вы не в силах были остановиться\nСев за стол и начав есть вы сразу почувствовали насколько вкусна эта еда" << endl;
	cout << "___________________________________________\nВы сидели и ели уже около 10 минут, как вздруг вы почувствовали удар по спине, а после и невыносимую боль...\nПосле чего вас кто-то схватил и скинул на пол...\nПеред смертью вы успели увидеть только летящий в вас топор\nВЫ ПОГИБЛИ" << endl;
	cout << "___________________________________________\nНАЧАТЬ ЗАНОВО: ";
	cin >> x;
	if (x == 2209) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		enter1(1, 0);
	}
	if (x == 5296) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		floor3(1, 0);
	}
	if (x > 0) {
		cout << endl << endl << endl;
	main();
    }
}
void kitchen3(int kit1) {
	int x;
	cout << "___________________________________________\nЗайдя на кухню вы увидели...кухню УДИВИТЕЛЬНО...\nНа столе стоит много еды...в воздухе ведает запах свежеприготовленной еды...\nВам очень захотелось поесть\nПодойдя к столу вы не в силах были остановиться\nСев за стол и начав есть вы сразу почувствовали насколько вкусна эта еда" << endl;
	cout << "___________________________________________\nВы сидели и ели уже около 10 минут, как вздруг вы почувствовали удар по спине, а после и невыносимую боль...\nПосле чего вас кто-то схватил и скинул на пол...\nПеред смертью вы успели увидеть только летящий в вас топор\nВЫ ПОГИБЛИ" << endl;
	cout << "___________________________________________\nНАЧАТЬ ЗАНОВО: ";
	cin >> x;
	if (x == 2209) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		enter1(1, 0);
	}
	if (x == 5296) {
		cout << endl << endl << "ЗАГРУЗКА СОХРАНЕНИЯ..." << endl << endl;
		cout << endl << endl << "СОХРАНЕНИЕ ЗАГРУЖЕНО УСПЕШНО" << endl << endl;
		floor3(1, 0);
	}
	if (x > 0) {
		cout << endl << endl << endl;
		main();
	}
}