#include <iostream>
using namespace std;
void floor3(int fl3, int fr3);
int main();
void floor1(int fl1, int fr1);
void ladder1(int lad1) {
	int x;
	if (lad1 == 1) {
		cout << "___________________________________________\nÂû ñèëüíî ðàçáåæàëèñü...íî ñïîòêíóëèñü î òîð÷àùèé ãâîçäü è óïàëè â ÿìó...\nÂÛ ÏÎÃÈÁËÈ\n" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0) {
			cout << endl << endl << endl;
			main();
		}
	}
}
void ladder2(int lad2) {
	int x;
	if (lad2 == 1) {
		cout << "___________________________________________\nÂû ñèëüíî ðàçáåæàëèñü...íî ñïîòêíóëèñü î òîð÷àùèé ãâîçäü è óïàëè â ÿìó...\nÂÛ ÏÎÃÈÁËÈ\n" << endl;
		cout << "___________________________________________\nÍÀ×ÀÒÜ ÇÀÍÎÂÎ: ";
		cin >> x;
		if (x == 2209) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			enter1(1, 0);
		}
		if (x == 5296) {
			cout << endl << endl << "ÇÀÃÐÓÇÊÀ ÑÎÕÐÀÍÅÍÈß..." << endl << endl;
			cout << endl << endl << "ÑÎÕÐÀÍÅÍÈÅ ÇÀÃÐÓÆÅÍÎ ÓÑÏÅØÍÎ" << endl << endl;
			floor3(1, 0);
		}
		if (x > 0) {
			cout << endl << endl << endl;
			main();
		}
	}
}
void ladder3(int lad3) {
	int x, y;
	if (lad3 == 1) {
		cout << "___________________________________________\nÂû ïîëîæèëè äîñêó è íåìíîãî çàôèêñèðîâàëè å¸ ãâîçäÿìè\nÒåïåðü ìîæíî ïîäíÿòüñÿ íà âòîðîé ýòàæ\nÏîäíÿòüñÿ 1" << endl;
		cin >> x;
		if (x == 1) {
			cout << "___________________________________________\nÂû ïîäíÿëèñü íà âòîðîé ýòàæ...ïîë ñêðèïåë ïîä âàøèìè íîãàìè, íî îñìîòðåâøèñü âû íàøëè:\nÊàáèíåò 1\nÑïàëüíÿ 2\nÊîìíàòà îòäûõà 3\n×åðäàê 4" << endl;
			cin >> y;
			floor1(0, y);
		}
	}
}